In [159]:
import pandas as pd

#### IMPORTING DATASET

In [160]:
mov = pd.read_csv("cleaned_movie.csv")
rat = pd.read_csv("cleaned_ratings.csv")

In [161]:
mov.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [162]:
rat.head()

   userId  movieId  rating
0       1      296     5.0
1       1      306     3.5
2       1      307     5.0
3       1      665     5.0
4       1      899     3.5

#### REDUCING MOVIES DATASET
TAKING ONLY THE TOP 10000 MOST VOTED MOVIES

In [163]:
group_count = rat.groupby(["movieId"]).count()
group_count = group_count.sort_values(by=["rating"],ascending = False )

In [164]:
group_count = group_count.head(10000)

In [165]:
group_count.tail()

         userId  rating
movieId
5234        103     103
7916        103     103
8753        103     103
26985       102     102
157276      102     102

In [166]:
mov_id = group_count.index.tolist()

In [167]:
mov = mov.loc[mov["movieId"].isin(mov_id)]
mov

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
54156,203519,Fast & Furious Presents: Hobbs & Shaw (2019),Action
54454,204352,Ad Astra (2019),Adventure|Drama|Mystery|Sci-Fi|Thriller
54513,204542,It: Chapter Two (2019),Horror
54575,204698,Joker (2019),Crime|Drama|Thriller
54798,205383,El Camino: A Breaking Bad Movie (2019),Crime|Drama|Thriller

#### SELECTING ONLY THE TOP 10000 USERS BY VOTE COUNTS

In [168]:
rat.head()

   userId  movieId  rating
0       1      296     5.0
1       1      306     3.5
2       1      307     5.0
3       1      665     5.0
4       1      899     3.5

In [169]:
rat.shape

(24773666, 3)

In [170]:
ratings = rat.loc[rat["movieId"].isin(mov_id)]

In [171]:
rate_count = ratings.groupby(["userId"]).count()

In [172]:
rate_count = rate_count.sort_values(by = "rating",ascending = False)

In [173]:
rate_count = rate_count.head(10000)

In [174]:
user = rate_count.index.tolist()
ratings = ratings.loc[ratings["userId"].isin(user)]
ratings

          userId  movieId  rating
246            3        1     4.0
247            3       29     4.5
248            3       32     4.5
249            3       50     5.0
250            3      111     4.0
...          ...      ...     ...
24770533  162519     4748     2.0
24770534  162519     4789     1.0
24770535  162519     4855     5.0
24770536  162519     4857     5.0
24770537  162519     5060     5.0

[8589212 rows x 3 columns]

#### SAVING THE DATASETS

In [175]:
ratings.to_csv("ratings.csv",index=False)
movies.to_csv("movies.csv",index=False)